{"bIdx":3077,"bType":"axiom","type":"","name":"df-cleq","params":"setvar s0, setvar s1, setvar s2, class c0, class c1","body":["|- wb(wceq(c0, c1), wal(s0, wb(wcel(cv(s0), c0), wcel(cv(s0), c1))))","-| wi(wal(s0, wb(wcel(cv(s0), cv(s1)), wcel(cv(s0), cv(s2)))), wceq(cv(s1), cv(s2)))","-| diffss(s0, s1)","-| diffss(s0, s2)","-| diffss(s1, s2)","-| diffsc(s0, c0)","-| diffsc(s0, c1)"],"bodyPretty":["⊢ (c0 = c1 ↔ ∀(s0,(s0 ∈ c0 ↔ s0 ∈ c1)))","⊣ (∀(s0,(s0 ∈ s1 ↔ s0 ∈ s2))→ s1 = s2)","⊣ d(s0, s1)","⊣ d(s0, s2)","⊣ d(s1, s2)","⊣ d(s0, c0)","⊣ d(s0, c1)"],"proof":[],"comment":"Define the equality connective between classes. Definition 2.7 of [Quine] p. 18. Also Definition 4.5 of [TakeutiZaring] p. 13; Chapter 4 provides its justification and methods for eliminating it. Note that its elimination will not necessarily result in a single wff in the original language but possibly a \"scheme\" of wffs. This is an example of a somewhat \"risky\" definition, meaning that it has a more complex than usual soundness justification (outside of Metamath), because it \"overloads\" or reuses the existing equality symbol rather than introducing a new symbol. This allows us to make statements that may not hold for the original symbol. For example, it permits us to deduce ` y = z <-> A. x ( x e. y <-> x e. z ) ` , which is not a theorem of logic but rather presupposes the Axiom of Extensionality (see theorem ~ axext4 ). We therefore include this axiom as a hypothesis, so that the use of Extensionality is properly indicated. See also comments under ~ df-clab , ~ df-clel , and ~ abeq2 . In the form of ~ dfcleq , this is called the \"axiom of extensionality\" by [Levy] p. 338, who treats the theory of classes as an extralogical extension to our logic and set theory axioms. While the three class definitions ~ df-clab , ~ df-cleq , and ~ df-clel are eliminable and conservative and thus meet the requirements for sound definitions, they are technically axioms in that they do not satisfy the requirements for the current definition checker. The proofs of conservativity require external justification that is beyond the scope of the definition checker. For a general discussion of the theory of classes, see ~ mmset.html#class . (Contributed by NM, 15-Sep-1993.)","parent":[],"children":["dfcleq","bj-ax9","bj-ax9-2"]}