{"bIdx":14106,"bType":"axiom","type":"","name":"df-seq","params":"setvar s0, setvar s1, class c0, class c1, class c2","body":["|- wceq(cseq(c0, c1, c2), cima(crdg(cmpo(s0, s1, universe, universe, cop(co(cv(s0), caddc, nat1), co(cv(s1), c1, cfv(c2, co(cv(s0), caddc, nat1))))), cop(c0, cfv(c2, c0))), com))","-| diffss(s0, s1)","-| diffsc(s0, c1)","-| diffsc(s1, c1)","-| diffsc(s0, c2)","-| diffsc(s1, c2)","-| diffsc(s0, c0)","-| diffsc(s1, c0)"],"bodyPretty":["⊢ seq(c0(c1, c2))=(rec((s0 ∈ 𝕌, s1 ∈ 𝕌 ↦ <(s0[+]1),(s1[c1](c2 `(s0[+]1)))>), < c0,(c2 ` c0)>)\" _om)","⊣ d(s0, s1)","⊣ d(s0, c1)","⊣ d(s1, c1)","⊣ d(s0, c2)","⊣ d(s1, c2)","⊣ d(s0, c0)","⊣ d(s1, c0)"],"proof":[],"comment":"Define a general-purpose operation that builds a recursive sequence (i.e., a function on an upper integer set such as ` NN ` or ` NN0 ` ) whose value at an index is a function of its previous value and the value of an input sequence at that index. This definition is complicated, but fortunately it is not intended to be used directly. Instead, the only purpose of this definition is to provide us with an object that has the properties expressed by ~ seq1 and ~ seqp1 . Typically, those are the main theorems that would be used in practice. The first operand in the parentheses is the operation that is applied to the previous value and the value of the input sequence (second operand). The operand to the left of the parenthesis is the integer to start from. For example, for the operation ` + ` , an input sequence ` F ` with values 1, 1/2, 1/4, 1/8,... would be transformed into the output sequence ` seq 1 ( + , F ) ` with values 1, 3/2, 7/4, 15/8,.., so that ` ( seq 1 ( + , F ) `` 1 ) = 1 ` , ` ( seq 1 ( + , F ) `` 2 ) = ` 3/2, etc. In other words, ` seq M ( + , F ) ` transforms a sequence ` F ` into an infinite series. ` seq M ( + , F ) ~~> 2 ` means \"the sum of F(n) from n = M to infinity is 2.\" Since limits are unique ( ~ climuni ), by ~ climdm the \"sum of F(n) from n = 1 to infinity\" can be expressed as ` ( ~~> `` seq 1 ( + , F ) ) ` (provided the sequence converges) and evaluates to 2 in this example. Internally, the ` rec ` function generates as its values a set of ordered pairs starting at ` <. M , ( F `` M ) >. ` , with the first member of each pair incremented by one in each successive value. So, the range of ` rec ` is exactly the sequence we want, and we just extract the range (restricted to omega) and throw away the domain. This definition has its roots in a series of theorems from ~ om2uz0i through ~ om2uzf1oi , originally proved by Raph Levien for use with ~ df-exp and later generalized for arbitrary recursive sequences. Definition ~ df-sum extracts the summation values from partial (finite) and complete (infinite) series. (Contributed by NM, 18-Apr-2005.) (Revised by Mario Carneiro, 4-Sep-2013.)","parent":[],"children":["seqex","seqeq1","seqeq2","seqeq3","nfseq","seqval"]}