{"index":1161,"title":"Extended real and complex numbers, real and complex projective lines","content":"In this section, we indroduce several supersets of the set ` RR ` of real numbers and the set ` CC ` of complex numbers. Once they are given their usual topologies, which are locally compact, both topological spaces have a one-point compactification. They are denoted by ` RRhat ` and ` CChat ` respectively, defined in ~ df-bj-cchat and ~ df-bj-rrhat , and the point at infinity is denoted by ` infty ` , defined in ~ df-bj-infty . Both ` RR ` and ` CC ` also have \"directional compactifications\", denoted respectively by ` RRbar ` , defined in ~ df-bj-rrbar (already defined as ` RR* ` , see ~ df-xr ) and ` CCbar ` , defined in ~ df-bj-ccbar . Since ` CCbar ` does not seem to be standard, we describe it in some detail. It is obtained by adding to ` CC ` a \"point at infinity at the end of each ray with origin at 0\". Although ` CCbar ` is not an important object in itself, the motivation for introducing it is to provide a common superset to both ` RRbar ` and ` CC ` and to define algebraic operations (addition, opposite, multiplication, inverse) as widely as reasonably possible. Mathematically, ` CCbar ` is the quotient of ` ( ( CC X. RR>=0 ) \\ { <. 0 , 0 >. } ) ` by the diagonal multiplicative action of ` RR>0 ` (think of the closed \"northern hemisphere\" in ` RR `^3 identified with ` ( CC X. RR ) ` , that each open ray from 0 included in the closed northern half-space intersects exactly once). Since in set.mm, we want to have a genuine inclusion ` CC C_ CCbar ` , we instead define ` CCbar ` as the (disjoint) union of ` CC ` with a circle at infinity denoted by ` CCinfty ` . To have a genuine inclusion ` RRbar C_ CCbar ` , we define ` pinfty ` and ` minfty ` as certain points in ` CCinfty ` . Thanks to this framework, one has the genuine inclusions ` RR C_ RRbar ` and ` RR C_ RRhat ` and similarly ` CC C_ CCbar ` and ` CC C_ CChat `. Furthermore, one has ` RR C_ CC ` as well as ` RRbar C_ CCbar ` and ` RRhat C_ CChat `. Furthermore, we define the main algebraic operations on ` ( CCbar u. CChat ) ` , which is not very mathematical, but \"overloads\" the operations, so that one can use the same notation in all cases.","blocks":[]}