{"index":1339,"title":"Propositions from _Begriffsschrift_","content":"In 1879, Frege introduced notation for documenting formal reasoning about propositions (and classes) which covered elements of propositional logic, predicate calculus and reasoning about relations. However, due to the pitfalls of naive set theory, adapting this work for inclusion in set.mm required dividing statements about propositions from those about classes and identifying when a restriction to sets is required. For an overview comparing the details of Frege's two-dimensional notation and that used in set.mm, see ~ mmfrege.html . See ~ ru for discussion of an example of a class that is not a set. Numbered propositions from [Frege1879]. ~ ax-frege1 , ~ ax-frege2 , ~ ax-frege8 , ~ ax-frege28 , ~ ax-frege31 , ~ ax-frege41 , frege52 (see ~ ax-frege52a , ~ frege52b , and ~ ax-frege52c for translations), frege54 (see ~ ax-frege54a , ~ frege54b and ~ ax-frege54c for translations) and frege58 (see ~ ax-frege58a , ~ ax-frege58b and ~ frege58c for translations) are considered \"core\" or axioms. However, at least ~ ax-frege8 can be derived from ~ ax-frege1 and ~ ax-frege2 , see ~ axfrege8 . Frege introduced implication, negation and the universal quantifier as primitives and did not in the numbered propositions use other logical connectives other than equivalence introduced in ~ ax-frege52a , ~ frege52b , and ~ ax-frege52c . In ~ dffrege69 , Frege introduced ` R hereditary A ` to say that relation ` R ` , when restricted to operate on elements of class ` A ` , will only have elements of class ` A ` in its domain; see ~ df-he for a definition in terms of image and subset. In ~ dffrege76 , Frege introduced notation for the concept of two sets related by the transitive closure of a relation, for which we write ` X ( t+ `` R ) Y ` , which requires ` R ` to also be a set. In ~ dffrege99 , Frege introduced notation for the concept of two sets either identical or related by the transitive closure of a relation, for which we write ` X ( ( t+ `` R ) u. _I ) Y ` , which is a superclass of sets related by the reflexive-transitive relation ` X ( t* `` R ) Y ` . Finally, in ~ dffrege115 , Frege introduced notation for the concept of a relation having the property elements in its domain pair up with only one element each in its range, for which we write ` Fun ``' ``' R ` (to ignore any non-relational content of the class ` R ` ). Frege did this without the expressing concept of a relation (or its transitive closure) as a class, and needed to invent conventions for discussing indeterminate propositions with two slots free and how to recognize which of the slots was domain and which was range. See ~ mmfrege.html for details. English translations for specific propositions lifted in part from a translation by Stefan Bauer-Mengelberg as reprinted in _From Frege to Goedel: A Source Book in Mathematical Logic, 1879-1931_. An attempt to align these propositions in the larger set.mm database has also been made. See ~ frege77d for an example.","blocks":[]}