{"index":1508,"title":"Magmas and internal binary operations (alternate approach)","content":"With ~ df-mpo , binary operations are defined by a rule, and with ~ df-ov , the value of a binary operation applied to two operands can be expressed. In both cases, the two operands can belong to different sets, and the result can be an element of a third set. However, according to Wikipedia \"Binary operation\", see https://en.wikipedia.org/wiki/Binary_operation (19-Jan-2020), \"... a binary operation on a set ` S ` is a mapping of the elements of the Cartesian product ` S X. S ` to S: ` f : S X. S --> S `. Because the result of performing the operation on a pair of elements of S is again an element of S, the operation is called a _closed_ binary operation on S (or sometimes expressed as having the property of closure).\". To distinguish this more restrictive definition (in Wikipedia and most of the literature) from the general case, we call binary operations mapping the elements of the Cartesian product ` S X. S ` _internal binary operations_, see ~ df-intop . If, in addition, the result is also contained in the set ` S `, the operation is called _closed internal binary operation_, see ~ df-clintop . Therefore, a \"binary operation on a set ` S `\" according to Wikipedia is a \"closed internal binary operation\" in our terminology. If the sets are different, the operation is explicitly called _external binary operation_ (see Wikipedia https://en.wikipedia.org/wiki/Binary_operation#External_binary_operations ). Taking a step back, we define \"laws\" applicable for \"binary operations\" (which even need not to be functions), according to the definition in [Hall] p. 1 and [BourbakiAlg1] p. 1, p. 4 and p. 7. These laws are used, on the one hand, to specialize internal binary operations (see ~ df-clintop and ~ df-assintop ), and on the other hand to define the common algebraic structures like magmas, groups, rings, etc. Internal binary operations, which obey these laws, are defined afterwards. Notice that in [BourbakiAlg1] p. 1, p. 4 and p. 7, these operations are called \"laws\" by themselves. In the following, an alternate definition ~ df-cllaw for an internal binary operation is provided, which does not require function-ness, but only closure. Therefore, this definition could be used as binary operation (Slot 2) defined for a magma as extensible structure, see ~ mgmplusgiopALT , or for an alternate definition ~ df-mgm2 for a magma as extensible structure. Similar results are obtained for an associative operation (defining semigroups).","blocks":[]}