{"index":648,"title":"ELEMENTARY GEOMETRY","content":"This part develops elementary geometry based on Tarski's axioms, following [Schwabhauser]. Tarski's geometry is a first-order theory with one sort, the \"points\". It has two primitive notions, the ternary predicate of \"betweenness\" and the quaternary predicate of \"congruence\". To adapt this theory to the framework of set.mm, and to be able to talk of *a* Tarski structure as a space satisfying the given axioms, we use the following definition, stated informally: A Tarski structure ` f ` is a set (of points) ` ( Base `` f ) ` together with functions ` ( Itv `` f ) ` and ` ( dist `` f ) ` on ` ( ( Base `` f ) X. ( Base `` f ) ) ` satisfying certain axioms (given in the definitions ~ df-trkg _et sequentes_). This allows us to treat a Tarski structure as a special kind of extensible structure (see ~ df-struct ). The translation to and from Tarski's treatment is as follows (given, again, informally). Suppose that one is given an extensible structure ` f ` . One defines a betweenness ternary predicate Btw by positing that, for any ` x , y , z e. ( Base `` f ) ` , one has \"Btw ` x y z ` \" if and only if ` y e. x ( Itv `` f ) z ` , and a congruence quaternary predicate Congr by positing that, for any ` x , y , z , t e. ( Base `` f ) ` , one has \"Congr ` x y z t ` \" if and only if ` x ( dist `` f ) y = z ( dist `` f ) t ` . It is easy to check that if ` f ` satisfies our Tarski axioms, then Btw and Congr satisfy Tarski's Tarski axioms when ` ( Base `` f ) ` is interpreted as the universe of discourse. Conversely, suppose that one is given a set ` a ` , a ternary predicate Btw, and a quaternary predicate Congr. One defines the extensible structure ` f ` such that ` ( Base `` f ) ` is ` a ` , and ` ( Itv `` f ) ` is the function which associates with each ` <. x , y >. e. ( a X. a ) ` the set of points ` z e. a ` such that \"Btw ` x z y ` \", and ` ( dist `` f ) ` is the function which associates with each ` <. x , y >. e. ( a X. a ) ` the set of ordered pairs ` <. z , t >. e. ( a X. a ) ` such that \"Congr ` x y z t ` \". It is easy to check that if Btw and Congr satisfy Tarski's Tarski axioms when ` a ` is interpreted as the universe of discourse, then ` f ` satisfies our Tarski axioms. We intentionally choose to represent congruence (without loss of generality) as ` x ( dist `` f ) y = z ( dist `` f ) t ` instead of \"Congr ` x y z t ` \", as it is more convenient. It is always possible to define ` dist ` for any particular geometry to produce equal results when conguence is desired, and in many cases there is an obvious interpretation of \"distance\" between two points that can be useful in other situations. Encoding congruence as an equality of distances makes it easier to use these theorems in cases where there is a preferred distance function. We prove that representing a congruence relationship using a distance in the form ` x ( dist `` f ) y = z ( dist `` f ) t ` causes no loss of generality in ~ tgjustc1 and ~ tgjustc2 , which in turn are supported by ~ tgjustf and ~ tgjustr . A similar representation of congruence (using a \"distance\" function) is used in Axiom A1 of [Beeson2016] p. 5, which discusses how a large number of formalized proofs were found in Tarskian Geometry using OTTER. Their detailed proofs in Tarski Geometry, along with other information, are available at ~ http://www.michaelbeeson.com/research/FormalTarski/ . Most theorems are in deduction form, as this is a very general, simple, and convenient format to use in Metamath. An assertion in deduction form can be easily converted into an assertion in inference form (removing the antecedents ` ph -> ` ) by insert a ` T. -> ` in each hypothesis, using ~ a1i , then using ~ mptru to remove the final ` T. -> ` prefix. In some cases we represent, without loss of generality, an implication antecedent in [Schwabhauser] as a hypothesis. The implication can be retrieved from the by using ~ simpr , the theorem as stated, and ~ ex . For descriptions of individual axioms, we refer to the specific definitions below. A particular feature of Tarski's axioms is modularity, so by using various subsets of the set of axioms, we can define the classes of \"absolute dimensionless Tarski structures\" ( ~ df-trkg ), of \"Euclidean dimensionless Tarski structures\" ( ~ df-trkge ) and of \"Tarski structures of dimension no less than N\" ( ~ df-trkgld ). In this system, angles are not a primitive notion, but instead a derived notion (see ~ df-cgra and ~ iscgra ). To maintain its simplicity, in this system congruence between shapes (a finite sequence of points) is the case where corresponding segments between all corresponding points are congruent. This includes triangles (a shape of 3 distinct points). Note that this definition has no direct regard for angles. For more details and rationale, see ~ df-cgrg . The first section is devoted to the definitions of these various structures. The second section (\"Tarskian geometry\") develops the synthetic treatment of geometry. The remaining sections prove that real Euclidean spaces and complex Hilbert spaces, with intended interpretations, are Euclidean Tarski structures. Most of the work in this part is due to Thierry Arnoux, with earlier work by Mario Carneiro and Scott Fenton. See also the credits in the comment of each statement.","blocks":[]}