{"index":838,"title":"Mathbox guidelines","content":"","blocks":[{"name":"mathbox","content":"(_This theorem is a dummy placeholder for these guidelines. The label of this theorem, \"mathbox\", is hard-coded into the Metamath program to identify the start of the mathbox section for web page generation_.) A \"mathbox\" is a user-contributed section that is maintained by its contributor independently from the main part of set.mm. _For contributors_: By making a contribution, you agree to release it into the public domain, according to the statement at the beginning of set.mm. Mathboxes are provided to help keep your work synchronized with changes in set.mm while allowing you to work independently without affecting other contributors. Even though in a sense your mathbox belongs to you, it is still part of the shared body of knowledge contained in set.mm, and occasionally other people may make maintenance edits to your mathbox for things like keeping it synchronized with the rest of set.mm, reducing proof lengths, moving your theorems to the main part of set.mm when needed, and fixing typos or other errors. If you want to preserve it the way you left it, you can keep a local copy or keep track of the GitHub commit number. _Guidelines_: 1. See ~ conventions for our general style guidelines. For contributing via GitHub, see ~ https://github.com/metamath/set.mm/blob/develop/CONTRIBUTING.md . The Metamath program command \"verify markup *\" will check that you have followed many of of the conventions we use. 2. If at all possible, please use only nullary class constants for new definitions, for example as in ~ df-div . 3. Each $p and $a statement must be immediately preceded with the comment that will be shown on its web page description. The Metamath program \"MM> WRITE SOURCE set.mm / REWRAP\" command will take care of indentation conventions and line wrapping. 4. All mathbox content will be on public display and should hopefully reflect the overall quality of the website. 5. Mathboxes must be independent from one another (checked by \"verify markup *\"). If you need a theorem from another mathbox, typically it is moved to the main part of set.mm. New users should consult with more experienced users before doing this. (Contributed by NM, 20-Feb-2007.) (Proof modification is discouraged.) (New usage is discouraged.)","origin":"thm mathbox(wff w0) {\n  |- w0\n  -| w0\n} = {\n  idi(w0)\n}","pretty":"thm mathbox(wff w0) {\n  ⊢ w0\n  ⊣ w0\n} = {\n  idi(w0)\n}","parent":["idi"],"children":[]}]}